app/controllers/todos_controller.rb

    def create
     @todo=Todo.new(todo_params)
     if @todo.save
---
INSERT INTO "todos" ("name", "description") VALUES (?, ?)  [["name", "dfvsr"], ["description", "cfsgwgrth"]]

    def show
        @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]